In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Name': ["Alice", "Bob", "Charlie"],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [8]:
df.query("Age > 30")

      Name  Age  Salary
2  Charlie   35   70000

In [9]:
max_salary = df['Salary'].max()

In [10]:
df.query("Salary == @max_salary")

      Name  Age  Salary
2  Charlie   35   70000